---
kind: method
id: M:Autodesk.Revit.DB.FabricationService.IsValidPaletteIndex(System.Int32)
source: html/910a66d8-190d-29a4-9129-4c5deb9eb729.htm
---
# Autodesk.Revit.DB.FabricationService.IsValidPaletteIndex Method

Validates the palette index.

## Syntax (C#)
```csharp
public bool IsValidPaletteIndex(
	int paletteIndex
)
```

## Parameters
- **paletteIndex** (`System.Int32`) - The palette index to check.

## Returns
True if larger or equal to 0 and less than PaletteCount.